IdeaRS.Connections
ColumnWidenerData.SegmentPartCode Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the code of the segment part Top Flange = 1 Bottom Flange = 2 Both Flanges = 3 Webs = 4 All CSS parts = 7
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int SegmentPartCode { get; set; }
Property Value
Type: Int32
See Also
Reference
ColumnWidenerData Class
IdeaRS.Connections.Data Namespace